# Part III - Application

1. Import pandas as pd.

In [4]:
import pandas as pd

In [5]:
student_data = {
                'id': ['1001-2', '1002-2', '1003-2', '1004-2', '1005-2'],
                'name': ['Johnathan Bernal', 'Sioned Allan', 'Cayden Collier', 'Jerome Rudd', 'Jibril Morrow'],
                'section': ['1A', '2A', '3B', '3D', '2E'],
                'year' : ['BSIT-1', 'BSIT-2', 'BSIT-3', 'BSIT-3', 'BSIT-2']
               }

In [6]:
student_data

{'id': ['1001-2', '1002-2', '1003-2', '1004-2', '1005-2'],
 'name': ['Johnathan Bernal',
  'Sioned Allan',
  'Cayden Collier',
  'Jerome Rudd',
  'Jibril Morrow'],
 'section': ['1A', '2A', '3B', '3D', '2E'],
 'year': ['BSIT-1', 'BSIT-2', 'BSIT-3', 'BSIT-3', 'BSIT-2']}

2. Create student dataframe from student_data dictionary

In [7]:
student = pd.DataFrame(student_data)

In [9]:
grades_data = {
    'id': ['1001-2', '1002-2', '1003-2', '1004-2', '1005-2'],
    'gpa': [91., 92., 88., 83., 75.],
}

3. Create grade dataframe from grades_data dictionary

In [10]:
grade = pd.DataFrame(grades_data)

4. Preview student dataFrame

In [11]:
student

       id              name section    year
0  1001-2  Johnathan Bernal      1A  BSIT-1
1  1002-2      Sioned Allan      2A  BSIT-2
2  1003-2    Cayden Collier      3B  BSIT-3
3  1004-2       Jerome Rudd      3D  BSIT-3
4  1005-2     Jibril Morrow      2E  BSIT-2

5. Preview grade dataFrame

In [12]:
grade

       id   gpa
0  1001-2  91.0
1  1002-2  92.0
2  1003-2  88.0
3  1004-2  83.0
4  1005-2  75.0

6. Merge student and grade dataFrame. Set the type of merge to inner and key to id

In [13]:
student_grades = pd.merge(student,grade,how='inner',on='id')

7. Create a student_df dataFrame from student_grades.

In [14]:
student_df = pd.DataFrame(student_grades)

8. Preview student_df dataFrame

In [15]:
student_df

       id              name section    year   gpa
0  1001-2  Johnathan Bernal      1A  BSIT-1  91.0
1  1002-2      Sioned Allan      2A  BSIT-2  92.0
2  1003-2    Cayden Collier      3B  BSIT-3  88.0
3  1004-2       Jerome Rudd      3D  BSIT-3  83.0
4  1005-2     Jibril Morrow      2E  BSIT-2  75.0

9. Print the information of student_df dataFrame

In [16]:
student_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       5 non-null      object
 1   name     5 non-null      object
 2   section  5 non-null      object
 3   year     5 non-null      object
 4   gpa      5 non-null      float64
dtypes: float64(1), object(4)
memory usage: 240.0+ bytes

10. Create a function named "deans_list" to check whether the student is a dean's lister or not. If gpa > 90.0 then the value must be 'Y' else the value is 'N'

In [21]:
student_df['deans_list'] = student_df['gpa'].apply(lambda gpa: 'Y' if gpa > 90 else 'N')

In [19]:
student_df

       id              name section    year   gpa deans_list
0  1001-2  Johnathan Bernal      1A  BSIT-1  91.0          Y
1  1002-2      Sioned Allan      2A  BSIT-2  92.0          Y
2  1003-2    Cayden Collier      3B  BSIT-3  88.0          N
3  1004-2       Jerome Rudd      3D  BSIT-3  83.0          N
4  1005-2     Jibril Morrow      2E  BSIT-2  75.0          N

11. Filter the student_df dataFrame that has a deans_list value equals to 'N'

In [25]:
student_df[student_df['deans_list'] == 'N']

       id            name section    year   gpa deans_list
2  1003-2  Cayden Collier      3B  BSIT-3  88.0          N
3  1004-2     Jerome Rudd      3D  BSIT-3  83.0          N
4  1005-2   Jibril Morrow      2E  BSIT-2  75.0          N

12. What was the average gpa of student per year level

In [27]:
gpa_level = student_df.groupby('year')

In [30]:
gpa_level_mean = gpa_level.mean()

In [31]:
gpa_level_mean

         gpa
year
BSIT-1  91.0
BSIT-2  83.5
BSIT-3  85.5

13. What is the average gpa of BSIT-3 students?

In [32]:
gpa_level_mean.loc['BSIT-3']

gpa    85.5
Name: BSIT-3, dtype: float64

14. What is the highest gpa per year level?

In [34]:
gpa_level.max()

            id              name section   gpa deans_list
year
BSIT-1  1001-2  Johnathan Bernal      1A  91.0          Y
BSIT-2  1005-2      Sioned Allan      2E  92.0          Y
BSIT-3  1004-2       Jerome Rudd      3D  88.0          N

15. Generate descriptive statistics.

In [35]:
gpa_level.describe()

         gpa
       count  mean        std   min    25%   50%    75%   max
year
BSIT-1   1.0  91.0        NaN  91.0  91.00  91.0  91.00  91.0
BSIT-2   2.0  83.5  12.020815  75.0  79.25  83.5  87.75  92.0
BSIT-3   2.0  85.5   3.535534  83.0  84.25  85.5  86.75  88.0